name: "PP-DocLayoutV3"
backend: "python"
max_batch_size: 8

input [
  {
    name: "image_bytes"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "layout_items"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]

dynamic_batching {
  preferred_batch_size: [ 4, 8 ]
  max_queue_delay_microseconds: 1000
}

parameters: {
  key: "EXECUTION_ENV_PATH"
  value: { string_value: "/opt/env.tar.gz" }
}
